#include <stdio.h>
#include "../SolarTermNew.h"
#include "../LunarGre.h"
#include "../Constellation.h"
#include "../BaZi.h"
#include "../WuXing.h"
#include <sys/timeb.h>
#include <time.h>

static char *shishen[] = {
    //    {"日/干", "甲", "乙", "丙", "丁", "戊", "己", "庚", "辛", "壬", "癸",
    /*"甲", */"比肩", "劫财", "食神", "伤官", "偏财", "正财", "七杀", "正官", "偏印", "正印",
    /*"乙", */"劫财", "比肩", "伤官", "食神", "正财", "偏财", "正官", "七杀", "正印", "偏印",
    /*"丙", */"偏印", "正印", "比肩", "劫财", "食神", "伤官", "偏财", "正财", "七杀", "正官",
    /*"丁", */"正印", "偏印", "劫财", "比肩", "伤官", "食神", "正财", "偏财", "正官", "七杀",
    /*"戊", */"七杀", "正官", "偏印", "正印", "比肩", "劫财", "食神", "伤官", "偏财", "正财",
    /*"己", */"正官", "七杀", "正印", "偏印", "劫财", "比肩", "伤官", "食神", "正财", "偏财",
    /*"庚", */"偏财", "正财", "七杀", "正官", "偏印", "正印", "比肩", "劫财", "食神", "伤官",
    /*"辛", */"正财", "偏财", "正官", "七杀", "正印", "偏印", "劫财", "比肩", "伤官", "食神",
    /*"壬", */"食神", "伤官", "偏财", "正财", "七杀", "正官", "偏印", "正印", "比肩", "劫财",
    /*"癸", */"伤官", "食神", "正财", "偏财", "正官", "七杀", "正印", "偏印", "劫财", "比肩"};

/**
 * 六十甲子
 */
extern char *jiazi[] = {
    "甲子", "乙丑", "丙寅", "丁卯", "戊辰", "己巳", "庚午", "辛未", "壬申", "癸酉",
    "甲戌", "乙亥", "丙子", "丁丑", "戊寅", "己卯", "庚辰", "辛巳", "壬午", "癸未",
    "甲申", "乙酉", "丙戌", "丁亥", "戊子", "己丑", "庚寅", "辛卯", "壬辰", "癸巳",
    "甲午", "乙未", "丙申", "丁酉", "戊戌", "己亥", "庚子", "辛丑", "壬寅", "癸卯",
    "甲辰", "乙巳", "丙午", "丁未", "戊申", "己酉", "庚戌", "辛亥", "壬子", "癸丑",
    "甲寅", "乙卯", "丙辰", "丁巳", "戊午", "己未", "庚申", "辛酉", "壬戌", "癸亥"
};

static const char *gan[] = {"甲", "乙", "丙", "丁", "戊", "己", "庚", "辛", "壬", "癸"};
static const char *zhi[] = {"子", "丑", "寅", "卯", "辰", "巳", "午", "未", "申", "酉", "戌", "亥"};
static const char *shengWangInfo[] = {"长生", "沐浴", "冠带", "临官", "帝旺", "衰", "病", "死", "墓", "绝", "胎", "养"};
static const char *xingxiuInfo[] = {
    "角", "亢", "氐", "房", "心", "尾", "箕", "斗", "牛", "女", "虚", "危", "室", "壁",
    "奎", "娄", "胃", "昂", "毕", "觜", "参", "井", "鬼", "柳", "星", "张", "翼", "轸"};
static char *nayinInfo[] = { "海中金", "炉中火", "大林木", "路旁土", "剑锋金", "山头火", "涧下水", "城墙土", "白腊金", "杨柳木", "泉中水","屋上土", "霹雷火", "松柏木", "常流水", "沙中金", "山下火", "平地木", "壁上土", "金箔金", "覆灯火", "天河水", "大驿土", "钗钏金", "桑松木", "大溪水","沙中土", "天上火", "石榴木", "大海水" };
static char *mingGeInfo[10][2]={
    {{"松树命"},{"您是森林中的松树，为他人牺牲奉献，让其它花木依靠，因此不容易守财。心性仁慈，喜欢有礼貌，有魄力的人。个性独立自主，积极进取，希望往上爬，没有依赖心。\n \
        根据命理来分析您的个性，潜意识，以及行为模式，您是属于「松树命」，因此您天生具有松树的特质，森林中的松树，不像灌木一样群聚在一起，而喜欢独立生长，越长越高，而且每一株都有不同的形状，能遮荫纳凉。因此您像松树一样，择善固执，独立自主，希望往上爬，不喜欢被埋没，没有依赖心，但有排他性，不容易让别人轻易了解您，也不喜欢搞小团体，习惯于固定的生活模式，不容易适应变动的环境，有自己的想法，能勇于做自已，有强烈的主观，敢于自我表达，能承担责任，照顾弱小。您的心肠很软，富有同情心，很容易受到感动。"}},
    {{"兰花命"},{"您是森林里的兰花，应该在温室中享福，却得像大树一样力争上游。心性仁慈，喜欢有礼貌，有魄力的人。外在的表现比内心坚强，渴望生长在温室中，喜欢安定，不喜欢冒险。\n \
        根据命理来分析您的个性，潜意识，以及行为模式，您是属于「兰花命」，因此您天生具有兰花的特性，兰花十分娇贵，生长在温室中，不容易照顾，需要细心呵护，阳光，水分或养分，过多过少都会让兰花枯竭。因此您像兰花一样，喜欢安定，不喜欢冒险，希望被关怀，不希望被冷落，当您在运势高潮的时候，生活会过得十分优雅，当您在运势低潮的时候，也不会降低您的生活品味。您乐于享受人生，是众人瞩目的优雅人物。您的感觉敏锐，对周遭的要求也比较高，甚至有点完美主义，一般人感觉不如您敏锐，不容易了解您，想法也跟您有落差，所以有些人会觉得不容易跟您相处，其实您心肠很软，富有同情心，很容易受到感动。"}},
    {{"太阳命"},{"您是天上的太阳，普照大地，但容易为别人而忙碌，缺少自己的时间。热情有礼，喜欢有智慧，守承诺的人。个性开朗，热心大方，不会斤斤计较，具有领导特质，不容易接受他人的指挥。\n \
        根据命理来分析您的个性，潜意识，以及行为模式，您是属于「太阳命」，因此您天生具有太阳的特质，开朗活泼，热心大方，不会斤斤计较，也不喜欢搞小团体，对于公理正义非常执着。太阳在天空发光发热，因此您天生具有老大命，也有领袖命，有表现欲望，但也有牺牲奉献的精神。太阳不会依自己的喜好来照耀大地，每一个地区都会受到普照，因此您喜欢一视同仁，公私分明，不喜欢有人假公济私，或搞小团体。太阳每天东升西降，规律运行，没有人能改变太阳的轨道，因此您也很有规律性以及耐心，极少半途而废，而且您也不能接受有人命令您要做什么，或不做什么。"}},
    {{"星辰命"},{"您是白昼的星辰，发光发热，但是却闲不下来，燃烧自己，照亮别人，因此不容易守财。热情有礼，喜欢有智慧，守承诺的人。个性聪明灵巧，学习能力强。\n \
        根据命理来分析您的个性，潜意识，以及行为模式，您是属于「星辰命」，因此您天生具有星辰的特质，天上的星辰闪烁不定，因此您思考比较快速，也容易有五分钟热度。星辰虽多，但光亮不如日月，因此您比较不喜欢出风头，也不喜欢给人很强势的感觉。星辰光芒不强，只照耀某些地方，因此您比较感性，好恶分明，您愿意为喜欢的人牺牲奉献，但是对于不喜欢的人却不想往来。星辰高挂天空，看尽世间，因此您天生就很聪明灵巧，学习能力强，对事物有多方面的兴趣，也能侃侃而谈，但却有滚石不生苔的问题，缺乏坚持到底的毅力。"}},
    {{"城堡命"},{"您是雄伟的城堡，牺牲奉献，服务人群，付出不求回报。重诺讲信，喜欢有仁慈，有魄力的人。外表随合，内心执着。不随便表示意见，优点也不轻易显露。\n \
        根据命理来分析您的个性，潜意识，以及行为模式，您是属于「城堡命」，因此您天生具有城堡的特质，愿意牺牲自己，保护别人，个性随遇而安，能接纳别人，属于有智慧，但不是小聪明的类型。城堡像大地一样，默默承受一切，因此您个性比较随和，但有点木讷，虽然有许多宝贵的看法，却不随便表示意见。城堡虽然雄伟，却常常被忽略，许多人享受城堡提供的一切，却习以为常，很少人会感谢城堡的付出，您也不喜欢邀功，所以一般人容易忽略您的贡献，一旦您离开了原先的岗位，人们才会发觉您的重要性。城堡的防御性很强，因此您的心防也很强，一般人不容易进入您的内心世界。城堡虽然坚固，却很包容，因此只要有优秀的人才，您愿意把舞台、机会让给别人，但您的内心却很执着，对于坚持到底的事情不轻易放弃，有点择善固执。"}},
    {{"花园命"},{"您是智慧的花园，沉浸在自己的世界，有自己的一片天空，但缺乏理财概念。重诺讲信，喜欢有仁慈，有魄力的人。外表随合，内心执着。不随便表示意见，优点也不轻易显露。\n \
        根据命理来分析您的个性，潜意识，以及行为模式，您是属于「花园命」，因此您天生具有花园的特质，愿意牺牲自己，保护别人，个性随遇而安，能接纳别人，属于有智慧，但不是小聪明的类型。花园底下是广阔的大地，您也像大地一样，默默承受一切，因此您个性比较随和，但有点木讷，虽然有许多宝贵的看法，却不随便表示意见。花园生养花草树木，但人们只注意到鸟语花香，却不会注意到脚下的大地，您也不喜欢邀功，所以一般人容易忽略您的贡献，一旦您离开了原先的岗位，人们才会发觉您的重要性。大地的防御性很强，因此您的心防也很强，一般人不容易进入您的内心世界。大地虽然坚固，却很包容，因此只要有优秀的人才，您愿意把舞台、机会让给别人，但您的内心却很执着，对于坚持到底的事情不轻易放弃，有点择善固执。"}},
    {{"宝剑命"},{"您是权力的宝剑，年轻时辛苦，但通过焠炼必成大器，充满统驭力与义气，抗压性强，愿意为别人付出。喜欢有礼貌，有智慧的人。个性带点霸气，有主导权与领导能力，对于现状的不满，能勇于突破。 \n \
        根据命理来分析您的个性，潜意识，以及行为模式，您是属于「宝剑命」，因此您天生具有宝剑的特质，有魄力、义气，与霸气。您也十分有才干与领导能力，富有公平心与正义感，喜欢保护弱小，不喜欢恃强凌弱，受人恩惠，必定回报，不愿意辜负别人，也不愿意占人便宜。宝剑虽然外在感觉比较强势，但内心却很温暖，吃软不吃硬。宝剑锐利无比，因此您对于现状的不满，能勇于突破，抗衡压力，改变环境，掌握自己的命运，但是宝剑有时后使用不当，也会伤到自己人，因此您有时候会太过积极，造成身边的人过大的压力。"}},
    {{"钻石命"},{"您是财富的钻石，有商业头脑，不愁富贵，充满精明与魅力，喜欢有礼貌，有智慧的人。生活优雅有情调，对生活品味也很重视。\n \
        根据命理来分析您的个性，潜意识，以及行为模式，您是属于「钻石命」，因此您天生具有钻石的特质，生活优雅有品味，十分引人注目，喜欢公平正义，不喜欢恃强凌弱，愿意牺牲奉献，不愿意辜负别人。钻石十分珍贵，都会被摆饰在最好，且最重要的位置，因此您非常有气质，也有多方面的才华，但是会有点优柔寡断，犹豫不决，做事情也比较慢。钻石硬度高，抗压性强，因此您对于现状的不满，能勇于突破，改变环境，并期望掌握自己的命运。"}},
    {{"大河命"},{"您是财富的大河，容易赚钱，也容易花钱，乐于享受人生。才华出众，喜欢有仁慈，守承诺的人。聪明灵敏，学习能力强，观察敏锐，但是缺乏执行力与行动力。\n \
        根据命理来分析您的个性，潜意识，以及行为模式，您是属于「大河命」，因此您天生具有大河水的特性，聪明有才华，学习能力强，观察敏锐，喜欢探究事物背后的道理，思路清晰，有独具一格的判断与分析能力，但是缺乏执行力与行动力。大河水波涛汹涌，一下流到这边，一下又弯到那边，因此您的思路十分活跃，一下想做这个，一下想做那个，想象力丰富，但是缺乏持续力，容易流于空谈。大河水由小支流汇集而成，流向大海，中途有些会形成云雾，或化成雨水，或流入湖泊，或进入地下水，因此您能够以不同的角色来适应周遭的环境，不论多恶劣，您也能渐渐适应，进而改变环境。您对于环境的变动有很强的适应力，所以容易给人表里不一的观感，但其实是一般人不容易想象您的思维模式。大河水川流不息，不容易停下脚步，因此您思考能力强，但执行能力弱，您对周遭生活有很多的不满与期待，也有能力改善，但就是不容易付诸行动。"}},
    {{"白云命"},{"您是权力的白云，可以掌握权力，但不愿意被拘束。才华出众，喜欢有仁慈，守承诺的人。有点唯美，爱好文艺，有多方面的兴趣与才华，但是缺乏执行力与行动力。\n \
        根据命理来分析您的个性，潜意识，以及行为模式，您是属于「白云命」，因此您天生具有白云的特质，聪明有才华，学习能力强，观察敏锐，喜欢探究事物背后的道理，思路清晰，有独具一格的判断与分析能力，但是缺乏执行力与行动力。白云随风飘流，一下飘到这边，一下又飞到天边，因此您的思路十分活跃，一下想做这个，一下想做那个，想象力丰富，但是缺乏持续力，容易流于空谈。白云变化万千，所谓白云苍狗，因此您能够以不同的角色来适应周遭的环境，不论多恶劣，您也能渐渐适应，进而改变环境。您对于环境的变动有很强的适应力，所以容易给人表里不一的观感，但其实是一般人不容易想象您的思维模式。白云漂浮不定，不容易停下脚步，因此您思考能力强，但执行能力弱，您对周遭生活有很多的不满与期待，也有能力改善，但就是不容易付诸行动。"}}
};

static char *wxPersonalityInfo[]={
    {"金主义，其性刚，其情烈，其味辣，其色白。金盛之人骨肉相称，面方白净，眉高眼深，体健神清。为人刚毅果断，疏财仗义，深知廉耻。\n金太过则有勇无谋，贪欲不仁。金不及则身材瘦小，为人刻薄内毒，喜淫好杀，吝啬贪婪。"},
    {"木主仁，其性直，其情和，其味酸，其色青。木盛的人长得丰姿秀丽，骨骼修长，手足细腻，口尖发美，面色青白。为人有博爱恻隐之心，慈祥恺悌之意，清高慷慨，质朴无伪。\n木衰之人则个子瘦长，头发稀少，性格偏狭，嫉妒不仁。木气绝之人则眉眼不正，项长喉结，肌肉干燥，为人鄙下吝啬。"},
    {"水主智，其性聪，其情善，其味咸，其色黑。水旺之人面黑有采，语言清和，为人深思熟虑，足智多谋，学识过人。\n水太过则好说是非，用情不专，烂桃花非常多。水不及则人物短小，性情无常，胆小无略，行事反覆。"},
    {"火主礼，其性急，其情恭，其味苦，其色赤。火盛之人头小脚长，上尖下阔，浓眉小耳，精神闪烁，为人谦和恭敬，纯朴急躁。\n火衰之人则黄瘦尖楞，语言妄诞，有自己的想法，做事有始无终。"},
    {"土主信，其性重，其情厚，其味甘，其色黄。土盛之人圆腰廓鼻，眉清木秀，口才声重。为人忠孝至诚，度量宽厚，言必行，行必果。\n土气太过则头脑僵化，愚拙不明，内向好静。不及之人面色忧滞，如是面扁鼻低，为人狠毒乖戾，不讲信用，不通情理。"},
};

static int DAY[12]={31,28,31,30,31,30,31,31,30,31,30,31};
static char *wuxingInfo[] = { "金", "木", "水", "火", "土" };
static char *mingGuaInfo[] = {"坎","坤","震","巽","","乾","兑","艮","离"};//第五个 男坤 女艮

long long getSystemTime() {
    struct timeb t;
    ftime(&t);
    return 1000 * t.time + t.millitm;
    //    return 0;
}

void tranBaZi(){
    initJieQi();
    
    calendar cal;
    memset(&cal, 0, sizeof(calendar));
    cal.solar.tm_year = 1990;
    cal.solar.tm_mon = 5-1;
    cal.solar.tm_mday = 28;
    cal.solar.tm_hour = 4;
    cal.solar.tm_min = 0;
    
    printf("时间==>%d-%d-%d %d:%d\n\n", cal.solar.tm_year, cal.solar.tm_mon, cal.solar.tm_mday, cal.solar.tm_hour, cal.solar.tm_min);
    
    int i;
    int sex = 1;
    //八字
    int gz[10];
    getBaZiTm(&cal.solar, gz);
    for(i=0;i<8;i+=2){
        printf("%s", gan[gz[i]]);
        printf("%s ", zhi[gz[i+1]]);
    }
    printf("日空==>%s%s\n", zhi[gz[8]], zhi[gz[9]]);
    printf("\n");
    
    //五行
    int gzWuXing[8];
    getWuXing(gz, gzWuXing);
    for (i=0; i<8; i++) {
        printf("%s ", wuxingInfo[gzWuXing[i]]);
    }
    printf("\n\n");
    
    //八字纳音
    for (i=0; i<4; i++) {
        int ny = getNaYin(gz[i*2], gz[i*2+1]);
        printf("%s ", nayinInfo[ny]);
    }
    printf("\n\n");
    
    //四柱十神
    printf("四柱干支十神==>\n");
    int shishenData[3];
    getShiShen(gz, shishenData);
    for (i=0; i<3; i++) {
        printf("%s ", shishen[shishenData[i]]);
        if(i==1){
            printf("日元 ");
        }
    }
    printf("\n\n");
    
    //臧干
    dizang dizangs[4];
    memset(dizangs, 0, sizeof(dizang)*3);
    printf("臧干==>\n");
    for (int j=0; j<4; j++) {
        dizang *dizang = dizangs+i;
        getDiZang(gz[j*2+1], gz[4], dizang);
        for(i=0;i<dizang->len;i++){
            printf("%s %s ", gan[dizang->dz[i][0]], shishen[dizang->dz[i][1]]);
        }
        printf("\n");
    }
    printf("\n");
    
    //大运
    printf("大运==>\n");
    int dayun[16];
    getDaYun(gz, isShun(gz[0], sex), dayun);
    for (i=0; i<16; i+=2) {
        printf("%s%s ", gan[dayun[i]], zhi[dayun[i+1]]);
    }
    printf("\n\n");
    
    //节气
    jieqi_date *between[2];
    getBetween(&cal.solar, between);
    for (i=0; i<2; i++) {
        char date[50];
        formT(&between[i]->date, date, 50);
        printf("%s:%s", between[i]->name, date);
    }
    printf("\n");
    
    //大运年
    int dayunDate[3];
    jiaoDaYun(&cal.solar, &between[isShun(gz[0], sex)]->date, dayunDate);
    printf("交大运==>%d年%d月%d日  ", dayunDate[0], dayunDate[1], dayunDate[2]);
    int daYunJiaoTiDay = cal.solar.tm_mday + dayunDate[2];
    
    int monDays = DAY[(cal.solar.tm_mon+1)%12];//获取当月天数
    if((cal.solar.tm_mon+1)%12==1 && isLeap(cal.solar.tm_year)) //闰二月
        monDays += 1;
    
    int daYunJiaoTiMon = cal.solar.tm_mon+1 + dayunDate[1] + daYunJiaoTiDay/monDays;
    printf("大运交替==>%d月%d日\n\n", daYunJiaoTiMon%12, daYunJiaoTiDay%monDays);
    
    //大运岁数
    int dayunAge[8];
    int yunAgeMon = cal.solar.tm_mon + dayunDate[1];
    yunAgeMon /= 12;
    for (i=0; i<8; i++) {
        dayunAge[i] = cal.solar.tm_year + (yunAgeMon+dayunDate[0]) +i*10;
    }
    for (i=0; i<8; i++) {
        printf("%d\t", dayunAge[i] - cal.solar.tm_year + 1);
    }
    printf("\n");
    for (i=0; i<8; i++) {
        printf("%d\t", dayunAge[i]);
    }
    printf("\n\n");
    
    //生旺死绝
    printf("生旺死绝==>\n");
    int shengWang[8];
    getShengWang(dayun, gz[4], shengWang);
    for (i=0; i<8; i++) {
        printf("%s ", shengWangInfo[shengWang[i]]);
    }
    printf("\n");
    
    //大运十神
    printf("大运十神==>\n");
    int daYunShiShen[16];
    for (i=0; i<8; i++) {
        printf("%s ", shishen[gz[4]*10 + dayun[i*2]]);
    }
    printf("\n\n");
    
    //排流年 jiazi
    int gzIndex = 0;
    for (i=0; i<60; i++) {
        if(i%10==gz[0] && i%12==gz[1]){
            gzIndex = i;
            break;
        }
    }
    gzIndex += dayunDate[0];
    gzIndex %= 60;
    
    for(i=0; i<10; i++){
        for (int j=0; j<8; j++) {
            int index = (gzIndex+i+10*j)%60;
            printf("%s\t", jiazi[index]);
        }
        printf("\n");
    }
    int liunianYear = dayunAge[0]+9;
    for (i=1; i<8; i++) {
        printf("%d ", liunianYear+10*i);
    }
    printf("\n\n");
    
    //星宿
    int xingxiu = getXingSu(cal.solar.tm_year, cal.solar.tm_mon, cal.solar.tm_mday);
    printf("星宿==>%s\n\n", xingxiuInfo[xingxiu]);
    
    printf("五行得分==>\n");
    double wxScore[9];
    for (i=0; i<9; i++) {
        wxScore[i] = 0.0;
    }
    wuXingScore(gz, wxScore);
    for (i=0; i<9; i++) {
        printf("%f ", wxScore[i]);
    }
    printf("\n");
    
    //日历
    printf("节气==>\n");
    jieqi_date *jieqi;
    jieqi_date *zhongqi;
    
    int cout = getCacheJieQi(cal.solar.tm_year, &jieqi, &zhongqi);
    
    for(i=0; i<cout; i++){
        char *name = jieqi[i].name;
        struct tm *time = &jieqi[i].date;
        
        char datetime[200];
        strftime(datetime, 200, "%y-%m-%d %H:%M:%S\n", time);
        printf("%s ==> %s", name, datetime);
    }
    printf("\n");
    
    //命卦
    int mg = getMingGua(cal.solar.tm_year, sex);
    printf("命卦==>%s\n", mingGuaInfo[mg]);
    
    printf("日历==>\n");
    solar2lunar(&cal);
    printCalendar(cal);
    printf("\n\n");
    
    //命格
    printf("%s==>%s\n\n",mingGeInfo[gz[4]][0], mingGeInfo[gz[4]][1]);
    //五行个性
    printf("个性==>%s\n\n", wxPersonalityInfo[gzWuXing[4]]);
}

typedef struct _dzStruct{
    int index_tg[3];    //
    double score[3][12];
    int len;                //长度
}dzStruct;

#if 0//测试
    const char *huaJiName11[] = {"[禄]","[权]","[科]","[忌]"};

char * get(int i){
    return *(huaJiName11+i);
}
#endif



int main(int argc, const char * argv[]) {
    long test = getSystemTime();
//    tranBaZi();
    
//    printf("==>%d\n", 10%9);//http://www.99166.com/suanming/bzsm/值得看
    getZiWeiInfo();
    
    printf("diff==>%lld\n", getSystemTime() - test);
    return 0;
}
//TODO 命卦 https://wenku.baidu.com/view/0547602c4b73f242336c5f3b.html
